{
    "name": "Gregorio Luna",
    "email": "",
    "phone": "",
    "education": [
        {
            "degree": "Bachelor of Professional Studies : Computer Information Systems",
            "institution": "DeVry Institute of Technology State",
            "start_year": "2003",
            "end_year": ""
        },
        {
            "degree": "Associate : Applied Science - Business Management and administration",
            "institution": "Kingsborough Community College City , State",
            "start_year": "1989",
            "end_year": ""
        }
    ],
    "experience": [
        {
            "job_title": "Operations Manager",
            "company": "Company Name",
            "start_year": "02/2010",
            "end_year": "08/2014",
            "description": "Managed a team of four client service officers responsible for day-to-day operations and onboarding process. Directed and supervised the daily activities of the teams with primary focus in enhancing the client s experience, mitigating risk, and identifying areas of improvement. Performed Quality Assurance reviews and approved due diligence reviews completed by the staff. Collaborated and managed assigned projects with cross-functional teams and departments including data and document collection and review, technology, sales and other client services groups across the firm. Coordinated with Front Office, Credit, Compliance, AML compliance and global client onboarding teams to understand client/deal structure and agree requirements/responsibilities. Participated in the development and drove implementation of department policies and/or procedures to help improve service and overall efficiency."
        },
        {
            "job_title": "Client Service Manager",
            "company": "",
            "start_year": "09/2007",
            "end_year": "02/2010",
            "description": "Within three months, increased efficiency by 20% by identifying and mitigating outdated manual processes and leveraging technology. Increased staff performance accuracy levels to 99%. Managed a team of eight client service officers responsible for servicing our base of Commercial Real Estate clients, Mortgage Servicers, and Regulated Cash. Serviced a portfolio of 300 clients with deposits in excess of 80 billion. Reviewed complex Cash Collateral agreements and client provided documentation to ensure compliance with regulatory and contractual requirements. Served as the escalation point for and coordinated the resolution of key issues and complex client concerns and opportunities. Analyzed complex data for management reporting nationwide on wire and deposit accounts providing adequate information for decision-making. Held monthly meetings with senior management to provide updates on all team projects, roadblocks and recommended solutions."
        },
        {
            "job_title": "Client Service Manager",
            "company": "",
            "start_year": "02/2002",
            "end_year": "09/2007",
            "description": "Built and fostered a proactive workplace environment resulting in a higher level of employee participation and performance. Supervised a team of seven client service professionals with a primary focus in delivering excellent client service, improving processes, and leveraging technology. Partnered with Bankers to collect, analyze, and validate all appropriate due diligence and on-boarding documentation provided by client; utilized knowledge of AML/KYC policy to independently identify missing or insufficient client due diligence information. Responsible for reviewing, entering and approving client information in KYC database, conducting OFAC reviews, and escalating findings. Extensive client contact in partnership with the Bankers to resolve customer concerns in regards to demand deposit accounts, short-term investments, funds transfers, and sales opportunities. Actively monitored service delivery for all Services / Product to client (via MIS, internal meetings, and client meetings)."
        }
    ],
    "skills": [
        "Adobe products",
        "interpersonal and communication",
        "oral",
        "Credit",
        "critical thinking",
        "resolve customer concerns",
        "client",
        "clients",
        "database",
        "decision-making",
        "delivery",
        "documentation",
        "due diligence",
        "Employee relations",
        "senior management",
        "fast",
        "focus",
        "Front Office",
        "functional",
        "funds",
        "hiring",
        "Illustrator",
        "investments",
        "legal",
        "management reporting",
        "meetings",
        "Excel",
        "Money",
        "Microsoft Office",
        "PowerPoint",
        "SharePoint",
        "Word",
        "MIS",
        "organizational",
        "performance management",
        "policies",
        "problem solving",
        "processes",
        "improving processes",
        "Quality Assurance",
        "Real Estate",
        "sales",
        "self-starter",
        "Spanish fluency",
        "time management",
        "written"
    ],
    "projects": [],
    "certifications": [
        {
            "name": "SEC Licenses Series 6 and 63",
            "institution": "",
            "start_year": "",
            "end_year": "Expired. Willing to retake."
        }
    ]
}